audiolibrary/trunk/app/controllers/audio_items_controller.rb

SELECT * FROM `categories` WHERE (`categories`.`parent_id` IS NULL)
SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
SELECT * FROM `audio_items` INNER JOIN `audio_items_categories` ON `audio_items`.id = `audio_items_categories`.audio_item_id WHERE (`audio_items_categories`.category_id = 8 )
SELECT `localizations`.* FROM `localizations` WHERE (`localizations`.audio_item_id IN (1,2,3))
SELECT * FROM `audio_items` WHERE (`audio_items`.`category_id` = '2')
SELECT * FROM `locales` WHERE (`locales`.`id` IN (1,2,3))
SELECT `categories`.id FROM `categories` INNER JOIN `audio_items_categories` ON `categories`.id = `audio_items_categories`.category_id WHERE (`categories`.`id` = 2) AND (`audio_items_categories`.audio_item_id = 3 ) LIMIT 1
---
  def index
    @categories = Category.all(:conditions => { :parent_id => nil })

    if params[:category_id]
      @category = Category.find(params[:category_id])
      @audio_items = AudioItem.all(:include => [ { :localizations => [ :locale ] } ])
      @audio_items.reject! { |a| !(a.categories.include? @category) }

SELECT * FROM `audio_items` WHERE (`audio_items`.`id` = 1)
SELECT * FROM `localizations` WHERE (`localizations`.audio_item_id = 1) LIMIT 1
---
  def show
    @audio_item = AudioItem.find(params[:id])
    @categories = Category.find(:all)

    if params[:localization_id]
      @default_localization = Localization.find(params[:localization_id])

SELECT * FROM `audio_items` WHERE (`audio_items`.`id` = 1)
SELECT * FROM `localizations` WHERE (`localizations`.audio_item_id = 5) LIMIT 1
---
  def edit
    @audio_item = AudioItem.find(params[:id])
    @categories = Category.find(:all)

    if params[:localization_id]
      @default_localization = Localization.find(params[:localization_id])

SELECT * FROM `categories` WHERE (`categories`.`id` = '2') LIMIT 1
INSERT INTO `audio_items` (`created_at`, `uuid`, `updated_at`, `category_id`) VALUES('2010-12-05 01:39:49', NULL, '2010-12-05 01:39:49', NULL)
---
  def create
    @audio_item = AudioItem.new(params[:audio_item])
    @categories = Category.find(:all)

    respond_to do |format|
      if @audio_item.save