audiolibrary/trunk/app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT * FROM `categories`

  def show
    @category = Category.find(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES('Agriculture', '2010-11-22 07:20:20', '2010-11-22 07:20:20')